src/cf/InformationRegisters/уатНоменклатураГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНоменклатураГСМ</Name>
			<Comment>Доп. сведения для ГСМ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетОстатковТЖ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппыГСМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГСМТалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛитровыйТалон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоминалТалона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатГруппыГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатГруппыГСМ</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрисадкиИТехническиеЖидкости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМасло</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электроэнергия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonForms/уатСписокГСМ/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ГруппаГСМ") И Параметры.Свойство("ТС") И Параметры.Свойство("Организация") Тогда
		Если Параметры.ГруппаГСМ = ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Талон") Тогда
			Заголовок = НСтр("en='Fuels coupons for cars.';ru='Талоны ГСМ для авто.'") + " " + Строка(Параметры.ТС);
		ИначеЕсли Параметры.ГруппаГСМ = ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.ПрисадкиИТехническиеЖидкости") Тогда
			Заголовок = НСтр("en='Additives and technical fluids';ru='Присадки и технические жидкости'");
		Иначе //топливо
			Если Параметры.БезАналогов Тогда
				Заголовок = НСтр("en='Main fuel for vehicle';ru='Основное топливо для ТС'") + " ";
			Иначе	
				Заголовок = НСтр("en='Fuel for vehicle';ru='Топливо для ТС'") + " ";
			КонецЕсли;
			Заголовок = Заголовок + Строка(Параметры.ТС);
		КонецЕсли;
		
		Если ТипЗнч(Параметры.ГруппаГСМ) = Тип("Массив") Тогда
			ТаблицаГСМ.Очистить();
			Для каждого ГруппаГСМ Из Параметры.ГруппаГСМ Цикл
				мсвГСМ = уатЗащищенныеФункцииСервер.СписокГСМдляТССервер(Параметры.Организация, Параметры.ТС, ГруппаГСМ, 
				Параметры.БезАналогов);
				флЕстьТалоны = Ложь;
				
				Для Каждого ТекЭл Из мсвГСМ Цикл
					Если ТаблицаГСМ.НайтиСтроки(ТекЭл).Количество() > 0 Тогда //исключаем дубли строк
						Продолжить;
					КонецЕсли;
					Если Параметры.Свойство("ВводОстатков") И ГруппаГСМ = Перечисления.уатГруппыГСМ.Электроэнергия Тогда
						СтруктураПоиска = Новый Структура("Номенклатура", ТекЭл.ГСМ);
						ВестиУчет = РегистрыСведений.уатНоменклатураГСМ.Получить(СтруктураПоиска).ВестиУчетОстатковТЖ;
						Если Не ВестиУчет Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					НоваяСтрока = ТаблицаГСМ.Добавить();
					НоваяСтрока.ГСМ = ТекЭл.ГСМ;
					НоваяСтрока.ГСМТалона = ТекЭл.ГСМТалона;
					НоваяСтрока.Литровый = ТекЭл.Литровый;
					НоваяСтрока.Номинал = ТекЭл.Номинал;
					
					Если ЗначениеЗаполнено(ТекЭл.ГСМТалона) Тогда
						флЕстьТалоны = Истина;
					КонецЕсли;
				КонецЦикла;
				
				Если флЕстьТалоны Тогда
					Элементы.ТаблицаГСМГСМТалона.Видимость = Истина;
					Элементы.ТаблицаГСМЛитровый.Видимость = Истина;
					Элементы.ТаблицаГСМНоминал.Видимость = Истина;
				КонецЕсли;
			КонецЦикла;
		Иначе
			мсвГСМ = уатЗащищенныеФункцииСервер.СписокГСМдляТССервер(Параметры.Организация, Параметры.ТС, Параметры.ГруппаГСМ, 
			Параметры.БезАналогов);
			ТаблицаГСМ.Очистить();
			
			флЕстьТалоны = Ложь;
			
			Для Каждого ТекЭл Из мсвГСМ Цикл
				Если ТаблицаГСМ.НайтиСтроки(ТекЭл).Количество() > 0 Тогда //исключаем дубли строк
					Продолжить;
				КонецЕсли;
				Если Параметры.Свойство("ВводОстатков") И Параметры.ГруппаГСМ = Перечисления.уатГруппыГСМ.Электроэнергия Тогда
					СтруктураПоиска = Новый Структура("Номенклатура", ТекЭл.ГСМ);
					ВестиУчет = РегистрыСведений.уатНоменклатураГСМ.Получить(СтруктураПоиска).ВестиУчетОстатковТЖ;
					Если Не ВестиУчет Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				НоваяСтрока = ТаблицаГСМ.Добавить();
				НоваяСтрока.ГСМ = ТекЭл.ГСМ;
				НоваяСтрока.ГСМТалона = ТекЭл.ГСМТалона;
				НоваяСтрока.Литровый = ТекЭл.Литровый;
				НоваяСтрока.Номинал = ТекЭл.Номинал;
				
				Если ЗначениеЗаполнено(ТекЭл.ГСМТалона) Тогда
					флЕстьТалоны = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если флЕстьТалоны Тогда
				Элементы.ТаблицаГСМГСМТалона.Видимость = Истина;
				Элементы.ТаблицаГСМЛитровый.Видимость = Истина;
				Элементы.ТаблицаГСМНоминал.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		// удаляем ТЖ с отключенным учетом остатков
		Если ЗначениеЗаполнено(Параметры.ТС) И Параметры.Свойство("ТолькоТЖсУчетомОстатка")
			И Параметры.ТолькоТЖсУчетомОстатка Тогда
			
			Сч = ТаблицаГСМ.Количество()-1;
			Пока Сч >= 0 Цикл
				Если уатГСМ.ЭтоТехническаяЖидкость(ТаблицаГСМ[Сч].ГСМ) И НЕ уатГСМ.УчитыватьОстаткиТЖ(ТаблицаГСМ[Сч].ГСМ) Тогда
					ТаблицаГСМ.Удалить(Сч);
				КонецЕсли;
				Сч = Сч - 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаГСМ

&НаКлиенте
Процедура ТаблицаГСМВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТаблицаГСМ.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Закрыть();
	Иначе
		Закрыть(ТекСтрока.ГСМ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
